# Application stores
cask "steam"
brew "mas"

# OS Customizations
cask "mos"

# Terminals
cask "iterm2"
cask "warp"

# Shells
brew "fish"

# Command line tools
brew "tree"
brew "bat"
brew "ranger"
brew "terminal-notifier"

## VS Code
cask "visual-studio-code"

## Emacs
tap "d12frosted/emacs-plus"
    brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-spacemacs-icon"]
tap "homebrew/cask-fonts"
    brew "subversion"
    cask "font-source-code-pro-for-powerline"

brew "ispell"
brew "the_silver_searcher"

# JDK
brew "jenv"

# Clojure
tap "clojure/tools"
    brew "clojure"
brew "leiningen"

## Clojure facility CLI tools
tap "borkdude/brew"
brew "jet"
brew "clj-kondo"

# Android Development
cask "android-studio"

# Python
brew "python"

# Containers
cask "docker"

# CG tools

cask "natron"
cask "blender"

mas "DaVinci Resolve", id: 571213070
mas "iMovie", id: 408981434
mas "Xcode", id: 497799835

# Communication

cask "slack"
cask "teamviewer"
cask "telegram"

# Office
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
cask "linear"
